tap "arl/arl"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bash"
brew "bat"
brew "python@3.12"
brew "cmake"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-gui"
brew "gitleaks"
brew "libevent"
brew "htop"
brew "httpie"
brew "httrack"
brew "iperf3"
brew "jq"
brew "keyring"
brew "llvm"
brew "mas"
brew "openjdk"
brew "maven"
brew "mypy", link: false
brew "neovim"
brew "netcat"
brew "ninja"
brew "nmap"
brew "nnn"
brew "openssl@1.1"
brew "pam-reattach"
brew "pandoc"
brew "pixi"
brew "pkg-config"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "postgresql@16", restart_service: true
brew "pstree"
brew "python@3.10"
brew "python@3.11"
brew "redis"
brew "rename"
brew "rlwrap"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "stow"
brew "swig"
brew "tabiew"
brew "tldr"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "xonsh"
brew "zeromq"
brew "arl/arl/gitmux"
cask "1password"
cask "anki"
cask "asana"
cask "backblaze"
cask "calibre"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "kindle"
cask "mimestream"
cask "notion"
cask "obsidian"
cask "pgadmin4"
cask "slack"
cask "spectacle"
cask "spotify"
cask "textexpander"
cask "utm"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Dark Reader for Safari", id: 1438243180
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "QuickShade", id: 931571202
vscode "asvetliakov.vscode-neovim"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "castello-dev.bash-snippets"
vscode "cha0ran.deletecurrentfile"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "crystal-spider.jsdoc-generator"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dorzey.vscode-sqlfluff"
vscode "drmerfy.overtype"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "grapecity.gc-excelviewer"
vscode "hars.cppsnippets"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "jannisx11.batch-rename-extension"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "karlito40.fix-irregular-whitespace"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "malmaud.tmux"
vscode "manueldelarosa.postgresql-snippets"
vscode "matangover.mypy"
vscode "mathematic.vscode-pdf"
vscode "mayeedwin.darkblack"
vscode "mdickin.markdown-shortcuts"
vscode "mohammadbaqer.better-folding"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "samueltscott.maximizeterminal"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "standard.vscode-standard"
vscode "stkb.rewrap"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "tyriar.vscode-terminal-here"
vscode "uniquevision.vscode-plpgsql-lsp"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wtetsu.tempfile"
vscode "yzhang.markdown-all-in-one"
